Repository: AMDmi3/pentobi
Catalog: pentobi_thumbnailer/po/*.po
Languages: ru

# _
source: translator-credits
ru: переводчик-вклад

source: Pentobi Command Reference
ru: Справочник команд Pentobi

source: thumbnailer for game records for the board game Blokus as used by the program Pentobi
ru: эскиз для записей игр Блокус, используемый Pentobi

source: <_:command-1/> <arg> <group choice="plain"> <arg choice="plain"><_:option-2/></arg> <arg choice="plain"><_:option-3/></arg> </group> <replaceable>n</replaceable> </arg> <arg choice="plain"><replaceable>inputfile</replaceable></arg> <arg choice="plain"><replaceable>outputfile</replaceable></arg>
ru: <_:command-1/> <arg> <group choice="plain"> <arg choice="plain"><_:option-2/></arg> <arg choice="plain"><_:option-3/></arg> </group> <replaceable>n</replaceable> </arg> <arg choice="plain"><replaceable>входной</replaceable></arg> <arg choice="plain"><replaceable>выходной</replaceable></arg>

source: Description
ru: Описание

source: <_:command-1/> is part of the program Pentobi and intended to be used as a thumbnailer for the Gnome desktop environment to generate previews of game files written by Pentobi.
ru: <_:command-1/> является частью программы Pentobi и предназначен для использования в качестве эскиза в среде рабочего стола Gnome для создания превью игровых файлов, написанных Pentobi.

source: The input file is a game file in Pentobi's SGF format as documented in Pentobi-SGF.md in the Pentobi source package. The output file is a thumbnail image in PNG format.
ru: Входной файл Pentobi представляет собой игровой файл в формате SGF, как описано в Pentobi-SGF.md в исходном пакете Pentobi. Выходной файл представляет собой уменьшенное изображение в формате PNG.

source: Options
ru: Параметры

source: Display help and exit.
ru: Показать справку и выйти.

source: The size of the thumbnail. The default is 128.
ru: Размер эскиза. По умолчанию 128.

source: Display version and exit.
ru: Показать версию и выйти.

source: Exit Status
ru: Состояние завершения

source: 0 if the thumbnail generation succeeds, 1 on error.
ru: 0 в случае успешной генерации эскиза, 1 в случае ошибки.

source: See Also
ru: Смотрите также
